# Information Systems for Engineers 2020 - Cheat Sheet

During the exam, you will be required to write SQL queries using a Jupyter notebook.

This notebook is designed to help you start writing your queries by providing you an environment and some simple queries that you can use to recap the syntax of SQL.

Feel free to extend this notebook and use it for preparing the answers you need for the exam. Take into attention that the content of this notebook will not be considered for grading.

## SQL

In [1]:
%load_ext sql
%sql postgresql://postgres:example@db

To print the tables currently loaded in the database run:

In [2]:
%%sql

SELECT * 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_TYPE = 'BASE TABLE' and TABLE_CATALOG = 'postgres' and TABLE_SCHEMA = 'public'
LIMIT 15;

 * postgresql://postgres:***@db
15 rows affected.

[('postgres', 'public', 'categories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'customers', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'nwemployees', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'employeeterritories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'order_details', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'orders', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'products', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'region', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'shippers', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'suppliers', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'territories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'movies', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'credits', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'stars_in', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('postgres', 'public', 'stations', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None)]

To print the attributes of a particular table ('categories', for example) run:

In [3]:
%%sql
SELECT column_name, data_type, character_maximum_length
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE table_name = 'categories';

 * postgresql://postgres:***@db
3 rows affected.

[('categoryid', 'smallint', None),
 ('categoryname', 'character varying', 15),
 ('description', 'text', None)]

For example, this is a valid PostgreSQL query to select one output entry:

In [4]:
%%sql
SELECT * 
FROM categories
LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (3, 'Confections', 'Desserts, candies, and sweet breads'),
 (4, 'Dairy Products', 'Cheeses')]

A more complex PostgreSQL query joining several tables would look like this:

In [5]:
%%sql
select lastname, firstname, territorydescription, regiondescription
from nwemployees, employeeterritories, territories, region
where nwemployees.employeeid = employeeterritories.employeeid and 
      employeeterritories.territoryid = territories.territoryid and
      territories.regionid = region.regionid
order by lastname
limit 4;

 * postgresql://postgres:***@db
4 rows affected.

[('Buchanan', 'Steven', 'Morristown', 'Eastern'),
 ('Buchanan', 'Steven', 'Edison', 'Eastern'),
 ('Buchanan', 'Steven', 'Providence', 'Eastern'),
 ('Buchanan', 'Steven', 'New York', 'Eastern')]

##### Note: the examples provided above do not contain all the query operations you might need during the exam.

Now its your turn, you can write all your queries in new cells below. Feel free to add as many cells as needed.

## Products

In [6]:
%%sql
SELECT * FROM products LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(1, 'Chai', 8, 1, '10 boxes x 30 bags', 18.0, 39, 0, 10, 1),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0, 17, 40, 25, 1),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10.0, 13, 70, 25, 0),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22.0, 53, 0, 0, 0)]

## Categories

In [7]:
%%sql
SELECT * FROM categories LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (3, 'Confections', 'Desserts, candies, and sweet breads'),
 (4, 'Dairy Products', 'Cheeses')]

## Nwemployees

In [8]:
%%sql
SELECT * FROM nwemployees LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[(1, 'Davolio', 'Nancy', 'Sales Representative', 'Ms.', datetime.date(1948, 12, 8), datetime.date(1992, 5, 1), '507 - 20th Ave. E.\\nApt. 2A', 'Seattle', 'WA', '98122', 'USA', '(206) 555-9857', '5467', 'Education includes a BA in psychology from Colorado State University in 1970.  She also completed "The Art of the Cold Call."  Nancy is a member of Toastmasters International.', 2, 'http://accweb/emmployees/davolio.bmp')]

## Orders

In [9]:
%%sql
SELECT * FROM orders LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany'),
 (10250, 'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10251, 'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France')]

## Order_details

In [10]:
%%sql
SELECT * FROM order_details LIMIT 4;

 * postgresql://postgres:***@db
4 rows affected.

[(10248, 11, 14.0, 12, 0.0),
 (10248, 42, 9.8, 10, 0.0),
 (10248, 72, 34.8, 5, 0.0),
 (10249, 14, 18.6, 9, 0.0)]

---

# Round 1

In [11]:
%%sql
SELECT COUNT(*)
FROM products p
JOIN categories c
ON p.categoryid = c.categoryid

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [12]:
%%sql
SELECT e.employeeid, e.firstname, SUM(unitprice * quantity)
FROM nwemployees e
JOIN orders o 
ON e.employeeid = o.employeeid
JOIN order_details od
ON o.orderid = od.orderid
GROUP BY e.employeeid, e.firstname
ORDER BY SUM(unitprice * quantity) DESC
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[(4, 'Margaret', 250187.4502530098),
 (3, 'Janet', 213051.2994799614),
 (1, 'Nancy', 202143.7103085518),
 (2, 'Andrew', 177749.2604765892),
 (7, 'Robert', 141295.99010276794)]

In [13]:
%%sql
SELECT COUNT(*)
FROM nwemployees NATURAL JOIN products
WHERE titleofcourtesy = 'Mrs.';

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [14]:
%%sql
SELECT c.categoryname, s.sum
FROM categories c
JOIN
    (SELECT categoryid, SUM(quantity)
    FROM nwemployees NATURAL JOIN products NATURAL JOIN order_details
    WHERE firstname = 'Robert'
    GROUP BY categoryid 
    ORDER BY SUM(quantity) DESC) s
ON c.categoryid = s.categoryid
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[('Beverages', 6669),
 ('Condiments', 3370),
 ('Confections', 5176),
 ('Dairy Products', 6006),
 ('Grains/Cereals', 3317)]

In [15]:
%%sql
SELECT COUNT(*) 
FROM orders
WHERE EXTRACT(MONTH FROM orderdate) = 3 AND shippeddate >= requireddate

 * postgresql://postgres:***@db
1 rows affected.

[(6,)]

In [16]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT s.supplierid, COUNT(DISTINCT productid)
    FROM suppliers s
    JOIN products p
    ON s.supplierid = p.supplierid
    WHERE p.discontinued != 1
    GROUP BY s.supplierid
    HAVING COUNT(DISTINCT productid) = 3)

 * postgresql://postgres:***@db
1 rows affected.

[(10,)]

In [17]:
%%sql
SELECT t.territorydescription
FROM nwemployees e
JOIN employeeterritories et
ON e.employeeid = et.employeeid
JOIN territories t
ON t.territoryid = et.territoryid
WHERE title != 'Sales Representative'
ORDER BY t.territorydescription ASC
LIMIT 1 OFFSET 4;

 * postgresql://postgres:***@db
1 rows affected.

[('Cambridge',)]

In [18]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT o.orderid, SUM(quantity)
    FROM orders o
    JOIN order_details od
    ON o.orderid = od.orderid
    WHERE discount != 0 IS TRUE 
    GROUP BY o.orderid) d
JOIN
    (SELECT o.orderid, SUM(quantity)
    FROM orders o
    JOIN order_details od
    ON o.orderid = od.orderid
    GROUP BY o.orderid) w
ON d.orderid = w.orderid
WHERE CAST(d.sum AS NUMERIC) / w.sum >= 0.5

 * postgresql://postgres:***@db
1 rows affected.

[(323,)]

In [19]:
%%sql
SELECT customerid, COUNT(orderid)
FROM orders
WHERE orderid IN
    (SELECT o.orderid
    FROM orders o
    JOIN order_details od
    ON o.orderid = od.orderid
    WHERE discount != 0)
GROUP BY customerid
ORDER BY COUNT(orderid) DESC
LIMIT 3;

 * postgresql://postgres:***@db
3 rows affected.

[('ERNSH', 19), ('SAVEA', 19), ('QUICK', 18)]

In [20]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT DISTINCT productid, unitprice, quantity, discount
    FROM order_details)

 * postgresql://postgres:***@db
1 rows affected.

[(1825,)]

---

# Round 2

In [21]:
%%sql
SELECT COUNT(*)
FROM products p
NATURAL JOIN categories c
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [22]:
%%sql
SELECT e.firstname, CAST(SUM(unitprice * quantity) AS int) AS tot_val
FROM nwemployees e
JOIN orders o
ON o.employeeid = e.employeeid
JOIN order_details od
ON o.orderid = od.orderid
GROUP BY e.firstname
ORDER BY tot_val DESC
LIMIT 10;

 * postgresql://postgres:***@db
9 rows affected.

[('Margaret', 250187),
 ('Janet', 213051),
 ('Nancy', 202144),
 ('Andrew', 177749),
 ('Robert', 141296),
 ('Laura', 133301),
 ('Anne', 82964),
 ('Michael', 78198),
 ('Steven', 75568)]

In [23]:
%%sql
SELECT COUNT(*)
FROM nwemployees
NATURAL JOIN products p1 
NATURAL JOIN products p2
NATURAL JOIN products p3
NATURAL JOIN products p4
NATURAL JOIN products p5
NATURAL JOIN products p6
WHERE titleofcourtesy = 'Mrs.'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [24]:
%%sql
SELECT categoryname, SUM(quantity) AS tot_quant
FROM nwemployees e
JOIN orders o
ON e.employeeid = o.employeeid
JOIN order_details od
ON o.orderid = od.orderid
NATURAL JOIN products
NATURAL JOIN categories
WHERE e.firstname = 'Robert'
GROUP BY categoryname
ORDER BY tot_quant DESC
LIMIT 10;

 * postgresql://postgres:***@db
8 rows affected.

[('Dairy Products', 724),
 ('Beverages', 610),
 ('Confections', 607),
 ('Seafood', 488),
 ('Meat/Poultry', 345),
 ('Condiments', 331),
 ('Grains/Cereals', 262),
 ('Produce', 134)]

In [25]:
%%sql
SELECT COUNT(*)
FROM orders
WHERE requireddate <= shippeddate AND EXTRACT(month FROM orderdate) = 3
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(6,)]

In [26]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT supplierid
    FROM suppliers
    NATURAL JOIN products
    WHERE discontinued != 1
    GROUP BY supplierid
    HAVING COUNT(DISTINCT productid) = 3)

 * postgresql://postgres:***@db
1 rows affected.

[(10,)]

In [27]:
%%sql
SELECT t.territorydescription
FROM employeeterritories et
NATURAL JOIN nwemployees e
NATURAL JOIN territories t
WHERE e.title != 'Sales Representative'
ORDER BY t.territorydescription ASC
LIMIT 1 OFFSET 4;

 * postgresql://postgres:***@db
1 rows affected.

[('Cambridge',)]

In [28]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT orderid, (SUM(is_disc * quantity) / CAST(SUM(quantity) AS float)) AS ratio
    FROM 
        (SELECT *, CAST(discount > 0 AS int) AS is_disc
        FROM orders o
        NATURAL JOIN order_details od)
    GROUP BY orderid
    HAVING SUM(is_disc * quantity) / CAST(SUM(quantity) AS float) >= 0.5)

 * postgresql://postgres:***@db
1 rows affected.

[(323,)]

In [29]:
%%sql
SELECT customerid, COUNT(DISTINCT orderid) AS num_orders
FROM orders o
NATURAL JOIN order_details od
WHERE discount > 0
GROUP BY customerid
ORDER BY num_orders DESC, customerid
LIMIT 3;

 * postgresql://postgres:***@db
3 rows affected.

[('ERNSH', 19), ('SAVEA', 19), ('QUICK', 18)]

In [30]:
%%sql
SELECT *
FROM order_details
LIMIT 10

 * postgresql://postgres:***@db
10 rows affected.

[(10248, 11, 14.0, 12, 0.0),
 (10248, 42, 9.8, 10, 0.0),
 (10248, 72, 34.8, 5, 0.0),
 (10249, 14, 18.6, 9, 0.0),
 (10249, 51, 42.4, 40, 0.0),
 (10250, 41, 7.7, 10, 0.0),
 (10250, 51, 42.4, 35, 0.15),
 (10250, 65, 16.8, 15, 0.15),
 (10251, 22, 16.8, 6, 0.05),
 (10251, 57, 15.6, 15, 0.05)]

In [31]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT DISTINCT productid, unitprice, quantity, discount
    FROM order_details)

 * postgresql://postgres:***@db
1 rows affected.

[(1825,)]

---

# Round 3

In [32]:
%%sql
SELECT COUNT(*)
FROM products p
JOIN categories c
ON p.categoryid = c.categoryid
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [33]:
%%sql
SELECT o.employeeid, ne.firstname, SUM(unitprice * quantity) AS tot_value
FROM orders o 
JOIN order_details od
ON o.orderid = od.orderid
JOIN nwemployees ne
ON ne.employeeid = o.employeeid
GROUP BY o.employeeid, ne.firstname
ORDER BY tot_value DESC
LIMIT 10;

 * postgresql://postgres:***@db
9 rows affected.

[(4, 'Margaret', 250187.4502530098),
 (3, 'Janet', 213051.2994799614),
 (1, 'Nancy', 202143.7103085518),
 (2, 'Andrew', 177749.2604765892),
 (7, 'Robert', 141295.99010276794),
 (8, 'Laura', 133301.0300655365),
 (9, 'Anne', 82963.9998178482),
 (6, 'Michael', 78198.09993362427),
 (5, 'Steven', 75567.75000333786)]

In [34]:
%%sql
SELECT COUNT(*)
FROM nwemployees nw
NATURAL JOIN products p1
NATURAL JOIN products p2
NATURAL JOIN products p3
NATURAL JOIN products p4
NATURAL JOIN products p5
NATURAL JOIN products p6
WHERE nw.titleofcourtesy = 'Mrs.'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [35]:
%%sql
SELECT c.categoryname, SUM(od.quantity) AS tot_quant
FROM nwemployees nw
NATURAL JOIN orders o
NATURAL JOIN order_details od
NATURAL JOIN products p
NATURAL JOIN categories c
WHERE nw.firstname = 'Robert'
GROUP BY c.categoryname
ORDER BY tot_quant DESC
LIMIT 10;

 * postgresql://postgres:***@db
8 rows affected.

[('Dairy Products', 724),
 ('Beverages', 610),
 ('Confections', 607),
 ('Seafood', 488),
 ('Meat/Poultry', 345),
 ('Condiments', 331),
 ('Grains/Cereals', 262),
 ('Produce', 134)]

In [36]:
%%sql
SELECT COUNT(*)
FROM orders o
WHERE EXTRACT(month FROM orderdate) = 3 AND shippeddate >= requireddate
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(6,)]

In [37]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT supplierid, COUNT(DISTINCT productid)
    FROM products
    WHERE discontinued = 0
    GROUP BY supplierid
    HAVING COUNT(DISTINCT productid) = 3);

 * postgresql://postgres:***@db
1 rows affected.

[(10,)]

In [38]:
%%sql
SELECT t.territorydescription AS fifth_territory
FROM territories t
NATURAL JOIN employeeterritories et
NATURAL JOIN nwemployees nw
WHERE title != 'Sales Representative'
ORDER BY t.territorydescription ASC
LIMIT 1 OFFSET 4;

 * postgresql://postgres:***@db
1 rows affected.

[('Cambridge',)]

In [39]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT orderid
    FROM 
        (SELECT orderid, CAST(quantity AS NUMERIC), CAST(discount > 0 AS INT) * quantity AS quantity_disc
        FROM orders
        NATURAL JOIN order_details)
    GROUP BY orderid
    HAVING SUM(quantity_disc) / SUM(quantity) >= 0.5)

 * postgresql://postgres:***@db
1 rows affected.

[(323,)]

In [40]:
%%sql
SELECT customerid, COUNT(DISTINCT orderid) AS num_orders
FROM orders
NATURAL JOIN order_details
WHERE discount > 0
GROUP BY customerid
ORDER BY num_orders DESC, customerid ASC
LIMIT 10;

 * postgresql://postgres:***@db
10 rows affected.

[('ERNSH', 19),
 ('SAVEA', 19),
 ('QUICK', 18),
 ('HUNGO', 15),
 ('LAMAI', 13),
 ('FOLKO', 12),
 ('FRANK', 10),
 ('LEHMS', 10),
 ('QUEEN', 10),
 ('BERGS', 9)]

In [41]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT DISTINCT productid, unitprice, quantity, discount
    FROM order_details)

 * postgresql://postgres:***@db
1 rows affected.

[(1825,)]

---

# Round 4

In [42]:
%%sql
SELECT COUNT(*)
FROM products p
NATURAL JOIN categories c
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [43]:
%%sql

LIMIT 10;

 * postgresql://postgres:***@db
(psycopg2.errors.SyntaxError) syntax error at or near "LIMIT"
LINE 1: LIMIT 10;
        ^

[SQL: LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [44]:
%%sql
SELECT firstname, SUM(quantity * unitprice) as tot_val
FROM nwemployees nw
NATURAL JOIN orders o
NATURAL JOIN order_details od
GROUP BY employeeid, firstname
ORDER BY tot_val DESC
LIMIT 10;

 * postgresql://postgres:***@db
9 rows affected.

[('Margaret', 250187.4502530098),
 ('Janet', 213051.2994799614),
 ('Nancy', 202143.7103085518),
 ('Andrew', 177749.2604765892),
 ('Robert', 141295.99010276794),
 ('Laura', 133301.0300655365),
 ('Anne', 82963.9998178482),
 ('Michael', 78198.09993362427),
 ('Steven', 75567.75000333786)]

In [45]:
%%sql
SELECT COUNT(*)
FROM nwemployees 
NATURAL JOIN products p1
NATURAL JOIN products p2
NATURAL JOIN products p3
NATURAL JOIN products p4
NATURAL JOIN products p5
NATURAL JOIN products p6
WHERE titleofcourtesy = 'Mrs.'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [46]:
%%sql
SELECT c.categoryid, c.categoryname, SUM(quantity) AS tot_quant
FROM nwemployees nw
JOIN orders o
ON nw.employeeid = o.employeeid
JOIN order_details od
ON od.orderid = o.orderid
JOIN products p
ON od.productid = p.productid
JOIN categories c
ON c.categoryid = p.categoryid
WHERE nw.firstname = 'Robert'
GROUP BY c.categoryid, c.categoryname
ORDER BY tot_quant DESC
LIMIT 10;

 * postgresql://postgres:***@db
8 rows affected.

[(1, 'Beverages', 948),
 (4, 'Dairy Products', 940),
 (3, 'Confections', 742),
 (8, 'Seafood', 555),
 (2, 'Condiments', 486),
 (6, 'Meat/Poultry', 395),
 (5, 'Grains/Cereals', 320),
 (7, 'Produce', 268)]

In [47]:
%%sql
SELECT COUNT(DISTINCT orderid)
FROM orders
WHERE EXTRACT(month FROM orderdate) = 3 AND shippeddate >= requireddate
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(6,)]

In [48]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT supplierid, COUNT(productid)
    FROM products
    WHERE discontinued = 0
    GROUP BY supplierid
    HAVING COUNT(productid) = 3)

 * postgresql://postgres:***@db
1 rows affected.

[(10,)]

In [49]:
%%sql
SELECT territorydescription
FROM employeeterritories et
JOIN nwemployees nw
ON nw.employeeid = et.employeeid
JOIN territories t
ON t.territoryid = et.territoryid
WHERE title != 'Sales Representative'
ORDER BY territorydescription ASC
LIMIT 1 OFFSET 4;

 * postgresql://postgres:***@db
1 rows affected.

[('Cambridge',)]

In [50]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT orderid, SUM(quant_disc) / SUM(CAST(quantity AS numeric)) >=  0.5 AS boolean
    FROM 
        (SELECT *, CAST(discount > 0 AS int) * quantity AS quant_disc
        FROM orders
        NATURAL JOIN order_details)
    GROUP BY orderid)
WHERE boolean IS TRUE

 * postgresql://postgres:***@db
1 rows affected.

[(323,)]

In [51]:
%%sql
SELECT customerid, COUNT(DISTINCT orderid) AS num_ord
FROM orders
NATURAL JOIN order_details
WHERE discount > 0
GROUP BY customerid
ORDER BY num_ord DESC, customerid
LIMIT 10;

 * postgresql://postgres:***@db
10 rows affected.

[('ERNSH', 19),
 ('SAVEA', 19),
 ('QUICK', 18),
 ('HUNGO', 15),
 ('LAMAI', 13),
 ('FOLKO', 12),
 ('FRANK', 10),
 ('LEHMS', 10),
 ('QUEEN', 10),
 ('BERGS', 9)]

In [52]:
%%sql
SELECT *
FROM order_details
LIMIT 10

 * postgresql://postgres:***@db
10 rows affected.

[(10248, 11, 14.0, 12, 0.0),
 (10248, 42, 9.8, 10, 0.0),
 (10248, 72, 34.8, 5, 0.0),
 (10249, 14, 18.6, 9, 0.0),
 (10249, 51, 42.4, 40, 0.0),
 (10250, 41, 7.7, 10, 0.0),
 (10250, 51, 42.4, 35, 0.15),
 (10250, 65, 16.8, 15, 0.15),
 (10251, 22, 16.8, 6, 0.05),
 (10251, 57, 15.6, 15, 0.05)]

In [53]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT DISTINCT productid, unitprice, quantity, discount
    FROM order_details)

 * postgresql://postgres:***@db
1 rows affected.

[(1825,)]

---

# Round 5

In [54]:
%%sql
SELECT COUNT(*)
FROM products p
NATURAL JOIN categories c
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [55]:
%%sql
SELECT nw.employeeid, nw.firstname, SUM(unitprice * quantity) AS tot_val
FROM nwemployees nw
JOIN orders o
ON o.employeeid = nw.employeeid
JOIN order_details od
ON od.orderid = o.orderid
GROUP BY nw.employeeid, nw.firstname
ORDER BY tot_val DESC
LIMIT 10;

 * postgresql://postgres:***@db
9 rows affected.

[(4, 'Margaret', 250187.4502530098),
 (3, 'Janet', 213051.2994799614),
 (1, 'Nancy', 202143.7103085518),
 (2, 'Andrew', 177749.2604765892),
 (7, 'Robert', 141295.99010276794),
 (8, 'Laura', 133301.0300655365),
 (9, 'Anne', 82963.9998178482),
 (6, 'Michael', 78198.09993362427),
 (5, 'Steven', 75567.75000333786)]

In [56]:
%%sql
SELECT COUNT(*)
FROM nwemployees
NATURAL JOIN products p1
NATURAL JOIN products p2
NATURAL JOIN products p3
NATURAL JOIN products p4
NATURAL JOIN products p5
NATURAL JOIN products p6
WHERE titleofcourtesy = 'Mrs.'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [57]:
%%sql 
SELECT c.categoryname, SUM(quantity) AS tot_quant
FROM nwemployees e
JOIN orders o
ON e.employeeid = o.employeeid
JOIN order_details od
ON od.orderid = o.orderid
JOIN products p
ON p.productid = od.productid
JOIN categories c
ON c.categoryid = p.categoryid
WHERE e.firstname = 'Robert'
GROUP BY c.categoryname 
ORDER BY tot_quant DESC
LIMIT 10;

 * postgresql://postgres:***@db
8 rows affected.

[('Beverages', 948),
 ('Dairy Products', 940),
 ('Confections', 742),
 ('Seafood', 555),
 ('Condiments', 486),
 ('Meat/Poultry', 395),
 ('Grains/Cereals', 320),
 ('Produce', 268)]

In [58]:
%%sql
SELECT COUNT(DISTINCT o.orderid)
FROM orders o
JOIN order_details od
ON o.orderid = od.orderid
WHERE EXTRACT(month from orderdate) = 3 AND shippeddate >= requireddate
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(6,)]

In [59]:
%%sql
SELECT COUNT(DISTINCT supplierid)
FROM 
    (SELECT supplierid
    FROM products
    WHERE discontinued = 0
    GROUP BY supplierid
    HAVING COUNT(productid) = 3)

 * postgresql://postgres:***@db
1 rows affected.

[(10,)]

In [60]:
%%sql
SELECT territorydescription
FROM territories t
JOIN employeeterritories et
ON t.territoryid = et.territoryid
JOIN nwemployees nw
ON nw.employeeid = et.employeeid
WHERE title != 'Sales Representative'
ORDER BY territorydescription ASC
LIMIT 1 OFFSET 4;

 * postgresql://postgres:***@db
1 rows affected.

[('Cambridge',)]

In [61]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT orderid
    FROM 
        (SELECT o.orderid, SUM(quantity) AS quant
        FROM orders o
        JOIN order_details od
        ON o.orderid = od.orderid
        GROUP BY o.orderid) AS t
    NATURAL JOIN
        (SELECT o.orderid, SUM(CAST(quantity AS NUMERIC)) AS quant_disc
        FROM orders o
        JOIN order_details od
        ON o.orderid = od.orderid
        WHERE discount > 0
        GROUP BY o.orderid) AS d
    WHERE quant_disc / quant >= 0.5)

 * postgresql://postgres:***@db
1 rows affected.

[(323,)]

In [62]:
%%sql
SELECT customerid, COUNT(DISTINCT o.orderid) AS num_orders
FROM orders o
JOIN order_details od
ON o.orderid = od.orderid
WHERE discount > 0
GROUP BY customerid
ORDER BY num_orders DESC, customerid
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('ERNSH', 19)]

In [63]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT DISTINCT productid, unitprice, quantity, discount
    FROM order_details)

 * postgresql://postgres:***@db
1 rows affected.

[(1825,)]

---

# Round 6

In [64]:
%%sql
SELECT COUNT(*)
FROM products p
NATURAL JOIN categories c
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [65]:
%%sql
SELECT nw.employeeid, nw.firstname, ROUND(SUM(CAST(unitprice AS NUMERIC) * quantity),0) AS tot_val
FROM nwemployees nw
JOIN orders o
ON nw.employeeid = o.employeeid
JOIN order_details od
ON od.orderid = o.orderid
GROUP BY nw.employeeid, nw.firstname
ORDER BY tot_val DESC
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[(4, 'Margaret', Decimal('250187')),
 (3, 'Janet', Decimal('213051')),
 (1, 'Nancy', Decimal('202144')),
 (2, 'Andrew', Decimal('177749')),
 (7, 'Robert', Decimal('141296'))]

In [66]:
%%sql
SELECT COUNT(*)
FROM nwemployees e
NATURAL JOIN products p1
NATURAL JOIN products p2
NATURAL JOIN products p3
NATURAL JOIN products p4
NATURAL JOIN products p5
NATURAL JOIN products p6
WHERE titleofcourtesy = 'Mrs.'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [67]:
%%sql
SELECT categoryname, SUM(quantity) AS tot_quant
FROM nwemployees nw
JOIN orders o
ON o.employeeid = nw.employeeid
JOIN order_details od
ON od.orderid = o.orderid
JOIN products p
ON p.productid = od.productid
JOIN categories c
ON c.categoryid = p.categoryid
WHERE firstname = 'Robert'
GROUP BY categoryname
ORDER BY tot_quant DESC
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[('Beverages', 948),
 ('Dairy Products', 940),
 ('Confections', 742),
 ('Seafood', 555),
 ('Condiments', 486)]

In [68]:
%%sql
SELECT COUNT(*)
FROM orders
WHERE EXTRACT(MONTH FROM orderdate) = 3 AND requireddate < shippeddate
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(5,)]

In [69]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT supplierid
    FROM products
    WHERE discontinued = 0
    GROUP BY supplierid
    HAVING COUNT(DISTINCT productid) = 3)

 * postgresql://postgres:***@db
1 rows affected.

[(10,)]

In [70]:
%%sql
SELECT territorydescription
FROM employeeterritories et
JOIN territories t
ON et.territoryid = t.territoryid
JOIN nwemployees nw
ON nw.employeeid = et.employeeid
WHERE nw.title != 'Sales Representative'
ORDER BY t.territorydescription ASC
LIMIT 1 OFFSET 4;

 * postgresql://postgres:***@db
1 rows affected.

[('Cambridge',)]

In [71]:
%%sql

SELECT COUNT(orderid)
FROM 
(SELECT o.orderid, SUM(quantity) AS quant_tot
FROM orders o
JOIN order_details od
ON o.orderid = od.orderid
GROUP BY o.orderid)
NATURAL JOIN
(SELECT o.orderid, SUM(quantity) AS quant_disc
FROM orders o
JOIN order_details od
ON o.orderid = od.orderid
WHERE discount > 0.0
GROUP BY o.orderid)
WHERE CAST(quant_disc AS NUMERIC) / quant_tot >= 0.5

 * postgresql://postgres:***@db
1 rows affected.

[(323,)]

In [72]:
%%sql
SELECT customerid, COUNT(DISTINCT o.orderid) AS tot_orders
FROM orders o
JOIN order_details od
ON o.orderid = od.orderid
WHERE discount > 0
GROUP BY customerid
ORDER BY tot_orders DESC, customerid ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('ERNSH', 19)]

In [73]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT DISTINCT productid, unitprice, quantity, discount
    FROM order_details)

 * postgresql://postgres:***@db
1 rows affected.

[(1825,)]

---

# Round 7

In [74]:
%%sql
SELECT COUNT(*)
FROM products
NATURAL JOIN categories
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [75]:
%%sql
SELECT nw.firstname, SUM(quantity * unitprice) AS tot_val
FROM nwemployees nw
JOIN orders o
ON nw.employeeid = o.employeeid
JOIN order_details od
ON od.orderid = o.orderid
GROUP BY nw.firstname
ORDER BY tot_val DESC
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[('Margaret', 250187.4502530098),
 ('Janet', 213051.2994799614),
 ('Nancy', 202143.7103085518),
 ('Andrew', 177749.2604765892),
 ('Robert', 141295.99010276794)]

In [76]:
%%sql
SELECT COUNT(*)
FROM nwemployees
NATURAL JOIN products p1
NATURAL JOIN products p2
NATURAL JOIN products p3
NATURAL JOIN products p4
NATURAL JOIN products p5
NATURAL JOIN products p6
WHERE titleofcourtesy = 'Mrs.'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [77]:
%%sql
SELECT c.categoryname, SUM(od.quantity) AS tot_quant
FROM nwemployees nw
JOIN orders o
ON nw.employeeid = o.employeeid
JOIN order_details od
ON o.orderid = od.orderid
JOIN products p
ON od.productid = p.productid
JOIN categories c
ON p.categoryid = c.categoryid
WHERE firstname = 'Robert'
GROUP BY c.categoryname
ORDER BY tot_quant DESC
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[('Beverages', 948),
 ('Dairy Products', 940),
 ('Confections', 742),
 ('Seafood', 555),
 ('Condiments', 486)]

In [78]:
%%sql
SELECT COUNT(DISTINCT orderid)
FROM orders
WHERE EXTRACT(MONTH FROM orderdate) = 3 AND shippeddate > requireddate
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(5,)]

In [79]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT supplierid
    FROM products
    WHERE discontinued = 0
    GROUP BY supplierid
    HAVING COUNT(DISTINCT productid) = 3)

 * postgresql://postgres:***@db
1 rows affected.

[(10,)]

In [80]:
%%sql
SELECT territorydescription
FROM territories t
JOIN employeeterritories et
ON t.territoryid = et.territoryid
JOIN nwemployees e
ON e.employeeid = et.employeeid
WHERE title != 'Sales Representative'
ORDER BY territorydescription ASC
LIMIT 1 OFFSET 4;

 * postgresql://postgres:***@db
1 rows affected.

[('Cambridge',)]

In [81]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT f.orderid
    FROM
        (SELECT o.orderid, SUM(quantity) AS sum
        FROM orders o
        JOIN order_details od
        ON o.orderid = od.orderid
        GROUP BY o.orderid) AS f
    JOIN
        (SELECT o.orderid, SUM(quantity) AS sum_disc
        FROM orders o
        JOIN order_details od
        ON o.orderid = od.orderid
        WHERE discount > 0
        GROUP BY o.orderid) AS d
    ON d.orderid = f.orderid
    WHERE CAST(sum_disc AS NUMERIC) / sum >= 0.5)

 * postgresql://postgres:***@db
1 rows affected.

[(323,)]

In [82]:
%%sql
SELECT customerid, COUNT(DISTINCT o.orderid) AS tot_orders
FROM orders o
JOIN order_details od
ON o.orderid = od.orderid
WHERE discount > 0
GROUP BY customerid
ORDER BY tot_orders DESC, o.customerid ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('ERNSH', 19)]

In [83]:
%%sql
SELECT COUNT(*)
FROM (SELECT DISTINCT productid, unitprice, quantity, discount
     FROM order_details)

 * postgresql://postgres:***@db
1 rows affected.

[(1825,)]

---

# Round 8

In [84]:
%%sql
SELECT COUNT(*)
FROM products
NATURAL JOIN categories
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [85]:
%%sql
SELECT nw.firstname
FROM orders o
JOIN order_details od
ON o.orderid = od.orderid
JOIN nwemployees nw
ON o.employeeid = nw.employeeid
GROUP BY nw.firstname
ORDER BY  SUM(quantity * unitprice) DESC
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[('Margaret',), ('Janet',), ('Nancy',), ('Andrew',), ('Robert',)]

In [86]:
%%sql
SELECT COUNT(*)
FROM nwemployees nw
NATURAL JOIN products p1
NATURAL JOIN products p2
NATURAL JOIN products p3
NATURAL JOIN products p4
NATURAL JOIN products p5
NATURAL JOIN products p6
WHERE titleofcourtesy = 'Mrs.'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [87]:
%%sql
SELECT categoryname
FROM orders o
JOIN order_details od
ON o.orderid = od.orderid
JOIN products p
ON od.productid = p.productid
JOIN categories c
ON p.categoryid = c.categoryid
JOIN nwemployees nw
ON o.employeeid = nw.employeeid
WHERE firstname = 'Robert'
GROUP BY categoryname
ORDER BY SUM(quantity) DESC
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[('Beverages',),
 ('Dairy Products',),
 ('Confections',),
 ('Seafood',),
 ('Condiments',)]

In [88]:
%%sql
SELECT COUNT(*)
FROM orders
WHERE EXTRACT(MONTH FROM orderdate) = 3 AND shippeddate > requireddate
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(5,)]

In [89]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT supplierid
    FROM products
    WHERE discontinued = 0
    GROUP BY supplierid
    HAVING COUNT(DISTINCT productid) = 3);

 * postgresql://postgres:***@db
1 rows affected.

[(10,)]

In [90]:
%%sql
SELECT territorydescription
FROM territories t
JOIN employeeterritories et
ON t.territoryid = et.territoryid
JOIN nwemployees nw
ON nw.employeeid = et.employeeid
WHERE title != 'Sales Representative'
ORDER BY territorydescription ASC
LIMIT 1 OFFSET 4;

 * postgresql://postgres:***@db
1 rows affected.

[('Cambridge',)]

In [91]:
%%sql
SELECT COUNT(*)
FROM 
    (SELECT o.orderid, SUM(quantity)
    FROM orders o
    JOIN order_details od
    ON o.orderid = od.orderid
    WHERE discount > 0
    GROUP BY o.orderid) AS d
JOIN 
    (SELECT o.orderid, SUM(quantity)
    FROM orders o
    JOIN order_details od
    ON o.orderid = od.orderid
    GROUP BY o.orderid) AS t
ON d.orderid = t.orderid AND CAST(d.sum AS NUMERIC) / t.sum >= 0.5
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(323,)]

In [92]:
%%sql
SELECT customerid, COUNT(DISTINCT o.orderid) AS tot_orders
FROM orders o
JOIN order_details od
ON o.orderid = od.orderid
WHERE discount > 0
GROUP BY customerid
ORDER BY tot_orders DESC, customerid ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('ERNSH', 19)]

In [93]:
%%sql
SELECT COUNT(*)
FROM (SELECT DISTINCT productid, unitprice, quantity, discount
     FROM order_details);

 * postgresql://postgres:***@db
1 rows affected.

[(1825,)]

---

# Round 9

In [96]:
%%sql
SELECT COUNT(*)
FROM products
NATURAL JOIN categories
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [106]:
%%sql
SELECT nw.firstname, SUM(quantity * unitprice) AS tot_val
FROM orders o
JOIN nwemployees nw
ON nw.employeeid = o.employeeid
JOIN order_details od
ON od.orderid = o.orderid
GROUP BY nw.firstname
ORDER BY tot_val DESC
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[('Margaret', 250187.4502530098),
 ('Janet', 213051.2994799614),
 ('Nancy', 202143.7103085518),
 ('Andrew', 177749.2604765892),
 ('Robert', 141295.99010276794)]

In [108]:
%%sql
SELECT COUNT(*)
FROM nwemployees
NATURAL JOIN products p1
NATURAL JOIN products p2
NATURAL JOIN products p3
NATURAL JOIN products p4
NATURAL JOIN products p5
NATURAL JOIN products p6
WHERE titleofcourtesy = 'Mrs.'
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(77,)]

In [119]:
%%sql
SELECT categoryname, SUM(quantity) AS tot_quant
FROM orders o
JOIN nwemployees nw
ON nw.employeeid = o.employeeid
JOIN order_details od
ON od.orderid = o.orderid
JOIN products p
ON p.productid = od.productid
JOIN categories c
ON c.categoryid = p.categoryid
WHERE firstname = 'Robert'
GROUP BY categoryname
ORDER BY tot_quant DESC
LIMIT 5;

 * postgresql://postgres:***@db
5 rows affected.

[('Beverages', 948),
 ('Dairy Products', 940),
 ('Confections', 742),
 ('Seafood', 555),
 ('Condiments', 486)]

In [124]:
%%sql
SELECT COUNT(*)
FROM orders
WHERE EXTRACT(MONTH FROM orderdate) = 3 AND shippeddate > requireddate
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(5,)]

In [129]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT supplierid
    FROM products
    WHERE discontinued = 0
    GROUP BY supplierid
    HAVING COUNT(productid) = 3)

 * postgresql://postgres:***@db
1 rows affected.

[(10,)]

In [137]:
%%sql
SELECT territorydescription
FROM employeeterritories et
JOIN nwemployees nw
ON et.employeeid = nw.employeeid
JOIN territories t
ON t.territoryid = et.territoryid
WHERE title != 'Sales Representative'
ORDER BY territorydescription ASC
LIMIT 1 OFFSET 4;

 * postgresql://postgres:***@db
1 rows affected.

[('Cambridge',)]

In [152]:
%%sql
SELECT COUNT(*)
FROM
    (SELECT o.orderid, SUM(quantity) AS tot_sum
    FROM orders o
    JOIN order_details od
    ON o.orderid = od.orderid
    GROUP BY o.orderid) AS t
JOIN
    (SELECT o.orderid, SUM(quantity) AS disc_sum
    FROM orders o
    JOIN order_details od
    ON o.orderid = od.orderid
    WHERE discount > 0
    GROUP BY o.orderid) AS d
ON d.orderid = t.orderid
WHERE CAST(disc_sum AS NUMERIC) / tot_sum >= 0.5

 * postgresql://postgres:***@db
1 rows affected.

[(323,)]

In [160]:
%%sql
SELECT customerid, COUNT(DISTINCT o.orderid) AS num_orders
FROM orders o
JOIN order_details od
ON o.orderid = od.orderid
WHERE discount > 0
GROUP BY customerid
ORDER BY num_orders DESC, customerid ASC
LIMIT 1;

 * postgresql://postgres:***@db
1 rows affected.

[('ERNSH', 19)]

In [170]:
%%sql
SELECT COUNT(*)
FROM (SELECT DISTINCT orderid, productid, unitprice, quantity, discount
     FROM order_details)
LIMIT 10;

 * postgresql://postgres:***@db
1 rows affected.

[(2155,)]

---